
## :white_check_mark: Apply Succeeded (account-data-deleter-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/14861)



<pre><code>Apply complete! Resources: 13 added, 1 changed, 16 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Refreshing state... [id=8114152441256386989]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950: Refreshing state... [id=P19YGTG]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B: Refreshing state... [id=P4IJH66]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D: Refreshing state... [id=PP4VIXJ]
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3: Refreshing state... [id=P8V7HIW]
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Reading...
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Reading...
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Refreshing state... [id=AccountDataDeleter-Prod-CodePipeline]
aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ]
data.terraform_remote_state.incident_management: Read complete after 1s
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Reading...
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Refreshing state... [id=pocket-codepipeline-5e8b11c04629213c9ebd8944b77cf15a]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Read complete after 0s [id=/AccountDataDeleter/Prod/SENTRY_DSN]
aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31: Refreshing state... [id=/Backend/AccountDataDeleter-Prod/ecs/app]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Reading...
aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Read complete after 0s [id=/AccountDataDeleter/CircleCI/Prod/SERVICE_HASH]
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Refreshing state... [id=/Backend/AccountDataDeleter-Prod/ecs/xray-daemon]
aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/f6571689-cb7b-491c-878b-e3f64918d69f]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_ecr_repository.data-deleter-app_application_ecs_service_ecr-app_ecr-repo_3026A62A: Refreshing state... [id=accountdatadeleter-prod-app]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Refreshing state... [id=AccountDataDeleter-Prod-AutoScalingRole]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Reading...
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Refreshing state... [id=AccountDataDeleter-Prod-CodePipelineRole:AccountDataDeleter-Prod-CodePipeline-Role-Policy]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Read complete after 0s [id=/Shared/PublicSubnets]
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Refreshing state... [id=AccountDataDeleter-Prod-CodePipelineRole]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Read complete after 0s [id=2591764522]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Read complete after 0s [id=1077804475]
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Reading...
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Read complete after 0s [id=us-east-1]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Refreshing state... [id=AccountDataDeleter-Prod-AutoScalingRole:AccountDataDeleter-Prod-AutoScalingPolicy]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Read complete after 0s [id=4250039221]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Processed_dynamodb_table_889BF31E: Refreshing state... [id=ADD-HistoricalDeletedUsers-Processed]
aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834: Refreshing state... [id=Z06690021XQYR4BI9JDYG]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Read complete after 0s [id=1349007126]
aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_ecs_cluster.data-deleter-app_application_ecs_cluster_72BD4946: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/AccountDataDeleter-Prod]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
aws_cloudwatch_event_rule.batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-rule_2852CA7A: Refreshing state... [id=AccountDataDeleter-Prod-BatchDelete-Lambda-Trigger-Rule]
aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Read complete after 0s [id=4250039221]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Reading...
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Reading...
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Read complete after 0s [id=/AccountDataDeleter/Prod/SENTRY_DSN]
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Reading...
aws_codedeploy_app.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-app_F69B4EF8: Refreshing state... [id=932b566b-77b2-4ba3-9500-bddb06d2a92f:AccountDataDeleter-Prod-BatchDeleteLambda-Lambda]
aws_codedeploy_app.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_3F6E9850: Refreshing state... [id=c103436b-3d9b-4895-b26d-74c1a061ae60:AccountDataDeleter-Prod-ECS]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Read complete after 0s [id=1349007126]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Pending_dynamodb_table_225C7A6D: Refreshing state... [id=ADD-HistoricalDeletedUsers-Pending]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Reading...
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Read complete after 1s [id=2591764522]
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Read complete after 0s [id=996905175585]
aws_codedeploy_app.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-app_8782CBBF: Refreshing state... [id=4d105cf4-2112-43e8-bc8a-ce92b7319b2c:AccountDataDeleter-Prod-Sqs-Event-Consumer-Lambda]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Read complete after 1s [id=/Shared/Vpc]
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Reading...
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Read complete after 1s [id=/AccountDataDeleter/CircleCI/Prod/SERVICE_HASH]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P5PEQYT]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P1DTPJ3]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Read complete after 0s [id=996905175585]
aws_ecr_lifecycle_policy.data-deleter-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_0035C10E: Refreshing state... [id=accountdatadeleter-prod-app]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Reading...
aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Read complete after 0s [id=3315687287]
aws_iam_policy.event-consumer_sqs-event-consumer_lambda_execution-policy_99388433: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role_91290640: Refreshing state... [id=AccountDataDeleter-Prod-TaskRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-execution-role_A0A8D414: Refreshing state... [id=AccountDataDeleter-Prod-TaskExecutionRole]
aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C: Refreshing state... [id=AccountDataDeleter-Prod-ECSCodeDeployRole]
aws_iam_role.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-role_9D02E0E0: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-CodeDeployRole]
aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole]
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_iam_role.batchdeletelambda_batch-delete-lambda_execution-role_28D715FA: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRole]
aws_route53_record.data-deleter-app_application_alb_certificate_certificate_record_88681242: Refreshing state... [id=Z06690021XQYR4BI9JDYG__ab448b998cae9a513fb845474d05e73b.account-data-deleter-api.readitlater.com._CNAME]
aws_iam_policy.batchdeletelambda_batch-delete-lambda_execution-policy_0CB4B8C7: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-BatchDeleteLambda-ExecutionRolePolicy]
aws_route53_record.data-deleter-app_application_base_dns_subhosted_zone_ns_D71A4B22: Refreshing state... [id=Z2BHWTOWFVNW3M_account-data-deleter-api.readitlater.com_NS]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Reading...
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Reading...
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Read complete after 0s [id=3224986813]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Reading...
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Read complete after 0s [id=2476603294]
aws_codestarnotifications_notification_rule.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_415EAA02: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/7dcf7784d5929c8bdd5fe74f0687f3cbe3effb71]
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_B4FDF02D: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-TaskExecutionRolePolicy]
aws_s3_bucket_public_access_block.event-consumer_sqs-event-consumer_lambda_code-bucket-public-access-block_AF8F837A: Refreshing state... [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Reading...
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Read complete after 0s [id=4193749989]
aws_s3_bucket_public_access_block.batchdeletelambda_batch-delete-lambda_code-bucket-public-access-block_1A938E94: Refreshing state... [id=pocket-accountdatadeleter-prod-batchdeletelambda]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_1BBB86C3: Refreshing state... [id=AccountDataDeleter-Prod-TaskExecutionRole-2022060219383271900000000d]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_DAFAA787: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole-20220602224300268900000002]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Refreshing state... [id=AccountDataDeleter-Prod]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Read complete after 0s [id=vpc-867638e3]
aws_codedeploy_deployment_group.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deployment-group_25E98995: Refreshing state... [id=703ee45b-4678-4238-bd8b-6a21d913a1b0]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ]
aws_codedeploy_deployment_group.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deployment-group_C5F30D1B: Refreshing state... [id=b905833b-81c6-45cc-972a-33e018dd862b]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-policy-attachment_70043CD9: Refreshing state... [id=AccountDataDeleter-Prod-BatchDeleteLambda-CodeDeployRole-20221114213608362400000001]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda_execution-role-policy-attachment_8D0214D0: Refreshing state... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole-20220602224300238700000001]
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role-policy_0A0BC3A4: Refreshing state... [id=arn:aws:iam::996905175585:policy/AccountDataDeleter-Prod-TaskRolePolicy]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_C5DC6D5A: Refreshing state... [id=AccountDataDeleter-Prod-ECSCodeDeployRole-2022060219383140510000000a]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing sta

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                 = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdatadeleter_eventconsumer_usereventssnssubscription_snstopicdql_A7941E81 has moved to aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E
    resource "aws_sqs_queue" "event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ"
        name                              = "AccountDataDeleter-Prod-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "AccountDataDeleter"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdatadeleter_eventconsumer_usereventssnssubscription_snsdlqpolicy_C27C5AF3 has moved to aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35
    resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdatadeleter_eventconsumer_usereventssnssubscription_snssqspolicy_FA60B53A has moved to aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07
    resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
        # (2 unchanged attributes hidden)
    }

  # local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09 will be created
  # (moved from local_file.accountdatadeleter_datadeleterapp_application_ecsservice_appspec_7CF72757)
  + resource "local_file" "data-deleter-app_application_ecs_service_appspec_5FC42C09" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA will be destroyed
  # (because null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA is not in configuration)
  - resource "null_resource" "accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA" {
      - id       = "8114152441256386989" -> null
      - triggers = {
          - "alwaysRun" = "2024-01-16T19:12:49Z"
        } -> null
    }

  # pagerduty_service.accountdatadeleter_pagerduty_pagerdutycritical_0D3094C0 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "P5PEQYT"
        name                    = "AccountDataDeleter-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.accountdatadeleter_pagerduty_pagerdutynoncritical_C143F7FE has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "P1DTPJ3"
        name                    = "AccountDataDeleter-Prod-PagerDuty-Non-Critical"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D will be destroyed
  # (because pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D is not in configuration)
  - resource "pagerduty_service_integration" "accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D" {
      - html_url        = "https://mozilla.pagerduty.com/services/P5PEQYT/integrations/PP4VIXJ" -> null
      - id              = "PP4VIXJ" -> null
      - integration_key = "32aac9e57ab54e0cd05b35d8b73a1371" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "P5PEQYT" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950 will be destroyed
  # (because pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950 is not in configuration)
  - resource "pagerduty_service_integration" "accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950" {
      - html_url        = "https://mozilla.pagerduty.com/services/P1DTPJ3/integrations/P19YGTG" -> null
      - id              = "P19YGTG" -> null
      - integration_key = "03aebda8fee04e05c03350f6ed49155f" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "P1DTPJ3" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3 will be destroyed
  # (because pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3 is not in configuration)
  - resource "pagerduty_service_integration" "accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3" {
      - html_url        = "https://mozilla.pagerduty.com/services/P5PEQYT/integrations/P8V7HIW" -> null
      - id              = "P8V7HIW" -> null
      - integration_key = "441703abd680470fc0a883229306b645" -> null
      - name            = "Sentry" -> null
      - service         = "P5PEQYT" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B will be destroyed
  # (because pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B is not in configuration)
  - resource "pagerduty_service_integration" "accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B" {
      - html_url        = "https://mozilla.pagerduty.com/services/P1DTPJ3/integrations/P4IJH66" -> null
      - id              = "P4IJH66" -> null
      - integration_key = "3f1b0b71d2db4e02c051d677c294c922" -> null
      - name            = "Sentry" -> null
      - service         = "P1DTPJ3" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "P5PEQYT"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "P1DTPJ3"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "P5PEQYT"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "P1DTPJ3"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 13 to add, 1 to change, 16 to destroy.
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Destroying... [id=8114152441256386989]
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Destruction complete after 0s
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B: Destroying... [id=P4IJH66]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3: Destroying... [id=P8V7HIW]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical:a5682df2-d0d9-4444-84b8-1d5cb9f7f469]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Destroying... [id=AccountDataDeleter-Prod-AutoScalingRole:AccountDataDeleter-Prod-AutoScalingPolicy]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical:8221dd5d-a32f-47d6-91f4-b8570b005f74]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Destroying... [id=AccountDataDeleter-Prod-CodePipelineRole:AccountDataDeleter-Prod-CodePipeline-Role-Policy]
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Destroying... [id=AccountDataDeleter-Prod-CodePipeline]
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Creating...
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Destruction complete after 0s
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Destroying... [id=AccountDataDeleter-Prod-ALBDashboard]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Destruction complete after 0s
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Destroying... [id=AccountDataDeleter-Prod-AutoScalingRole]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Destruction complete after 0s
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destroying... [id=AccountDataDeleter-Prod]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Destruction complete after 0s
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D: Destroying... [id=PP4VIXJ]
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destruction complete after 0s
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Destroying... [id=AccountDataDeleter-Prod-CodePipelineRole]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B: Destruction complete after 0s
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950: Destroying... [id=P19YGTG]
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Destruction complete after 0s
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Destroying... [id=pocket-codepipeline-5e8b11c04629213c9ebd8944b77cf15a]
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Creation complete after 0s [id=pocket-accountdatadeleter-prod-sqs-event-consumer]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifying... [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3: Destruction complete after 0s
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Destroying... [id=/Backend/AccountDataDeleter-Prod/ecs/xray-daemon]
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Destruction complete after 0s
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creating...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D: Destruction complete after 1s
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Creating...
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Creation complete after 1s [id=pocket-accountdatadeleter-prod-batchdeletelambda]
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Creating...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950: Destruction complete after 1s
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Creation complete after 0s [id=pocket-accountdatadeleter-prod-sqs-event-consumer,private]
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Creation complete after 0s [id=pocket-accountdatadeleter-prod-batchdeletelambda,private]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creation complete after 1s [id=AccountDataDeleter-Prod]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Creating...
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creating...
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creation complete after 0s [id=e92d92999cc4a109b86a8569d34979c8c5d93a52]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=P3BGIIS]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 1s [id=P02VI62]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 1s [id=PILEIT9]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 1s [id=P7O4JXF]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Creation complete after 0s [id=AccountDataDeleter-Prod]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical:1aa392e1-40a6-477b-bbe0-d3bc3b71c05d]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical:a2574e75-ed5c-4dee-9a28-a9dec83655f6]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifications complete after 7s [id=AccountDataDeleter-Prod-Sqs-Event-Consumer-Function]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Still destroying... [id=pocket-codepipeline-5e8b11c04629213c9ebd8944b77cf15a, 10s elapsed]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Destruction complete after 17s
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 3193, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3193:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵

Apply complete! Resources: 13 added, 1 changed, 16 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"48debbc7-e4d2-43bc-9259-b7ff0e77935d","JobName":"account-data-deleter_infrastructure_apply_prod","PRNumber":72,"Program":"tfcmt","SHA1":"ecf4ba005fe49266b0cc4cb2c80e40748589a46c","Target":"account-data-deleter-cdk","Vars":{}} -->